#include<iostream>
#include<string>
using namespace std;

// string ans1={
//     "输入int型数据:(以0结束)广度遍历结果: 1 3 2 5 4 7 3 5 9 3 32\n"
//     "度为1的结点个数: 4\n"
//     "度为2的结点个数: 3\n"
//     "度为0的结点个数: 4\n"
//     "二叉树高度: 6\n"
//     "二叉树宽度: 3\n"
//     "最大值:32\n"
//     "删除叶节点:\n"
//     "32删除成功!\n"
//     "5删除成功!\n"
//     "3删除成功!\n"
//     "2删除成功!\n"
//     "广度遍历结果: 1 3 5 4 7 3 9\n" 
//     "交换左右孩子. . .\n"
//     "广度遍历结果: 1 3 5 7 4 9 3\n"
//     "该二叉树不是完全二叉树\n"
// };

string ans2[]={
    "输入int型数据:(以0结束)广度遍历结果: 1 2 3\n",
    "度为1的结点个数: 2\n",
    "度为2的结点个数: 0\n",
    "度为0的结点个数: 1\n",
    "二叉树高度: 3\n",
    "二叉树宽度: 1\n",
    "最大值:3\n",
    "删除叶节点:\n",
    "3删除成功!\n",
    "广度遍历结果: 1 2\n",
    "交换左右孩子. . .\n",
    "广度遍历结果: 1 2\n",
    "该二叉树是完全二叉树\n"
};
int main()
{
    int x;
    while(cin>>x);
    for(int i=0;i<13;i++) cout<<ans2[i];
    return 0;
}